##
## CASE1 : 공공데이터 수집분석
##
## update: 21.04.22
## update: 21.05.14

## =====================================================
## 00. 환경정보 초기화
## =====================================================
  source("lab_00_기본환경설정.R")


## =====================================================
## 01.데이터 읽어 오기
## =====================================================
  rm(list=ls())
  military = read.csv("./data/case1_육군 신체측정 데이터.csv",header=T) 

## =====================================================
## 02.데이터 살펴보기
## =====================================================
## -- (1) 30건 데이터 보기
  head(military,30) 
  View(military)
  
## -- (2) 특정 항목 데이터 보기
  a <- military$키 
  military$몸무게 -> b

## =====================================================
## 03.시각화
## =====================================================
  plot(military$키, military$몸무게,
       main="육군신체치수",
       pch=22,las=1,
       xlab="키",ylab="몸무게") 

  points(military$키,military$몸무게, 
         cex = .2, col = "dark blue") 
  
## lm()=linear regression의 핵심으로, 회귀분석, 단일 계층 분석, 공분산 분석에 이용  
  f = lm(military$몸무게 ~ military$키) 
  f

  abline(f,col="red") 
  
## =====================================================
## 04.통계량 보기
## =====================================================
  summary(f)

## END ## 