##
## mini Project 02 : 간단한 숫자 맞추기 게임(b)
##      10회동안 맞추기
## update: 19.12.11
## update: 20.05.12
## update: 21.05.14

## =====================================================
## 01. 환경정보 초기화
## =====================================================
  source("lab_00_기본환경설정.R")

## =====================================================
## 02. Main
## =====================================================
  
  # 프로그램 답 지정
  target_num <- 123
  
  # 숫자 추측 게임 시작
  print("+++ 숫자 맞추기 게임(Guessing Game) +++ ")
  
  for(loop in 1: 10){
    guess_num <- scan(n=1)
    
    if(guess_num == target_num) {
      cat("출하합니다. 정답니다.", loop, "번만에 맞첬습니다.")
      break
    } else if (guess_num < target_num) {
      cat("답은 더 큰 숫자입니다. =>", loop)
    } else  {
      cat("답은 더 작은 숫자입니다.=>", loop)
    }   
    
  }
  
## END
